# import ? -> 미리 만들어 놓은 소스코드를 가져와서 쓰고 싶을 때 사용.
# 라이브러리 ? -> 미리 누군가 만들어 놓은 코드
# 구글에다가 검색해서 새로운 기능을 추가하는 경우 : A라는 기능을 쓰기 위해서는 어떤 라이브러리가 필요하지?? -> 암기 할 필요가 전혀없고, 불가능이다. 그냥 검색해서 복사 붙여 넣기.
print("\n*************************************ex1*************************************")
# 제곱근 구하기
# math 라는 라이브러리에 뭐가 있는지 궁금하면? ctrl + 클릭 -> 누군가 미리 수학과 관련된 함수들을 math라는 라이브러리에 만들어 두었다.
# 제곱근을 구하는 방법은 sqrt라는 함수를 이용하면 된다.
import math
# math라는 라이브러리에서 sqrt 라는 함수를 선택한 것.
a=math.sqrt(9)
print(a)



print("\n*************************************ex2*************************************")
# 제곱근 구하기2
# math라이브러리에는 수많은 함수들이 미리 정의가 되어있는데 그 중에 sqrt라는 함수만 사용하고 싶은 경우
from math import sqrt
# sqrt 앞에 math. 을 쓰지 않아도 바로 사용 가능
a=sqrt(9)
print(a)


